Duet3D/Duet3Expansion/src/atmel/SAMDA1_DFP/1.2.50/samda1b/atdf/ATSAMDA1J14B.atdf
      <value-group name="I2S_CLKCTRL__MCKSEL">
        <value name="GCLK" caption="GCLK_I2S_n is used as Master Clock n source" value="0x0"/>
        <value name="MCKPIN" caption="MCKn input pin is used as Master Clock n source" value="0x1"/>
      </value-group>
      <value-group name="I2S_CLKCTRL__SCKSEL">
        <value name="MCKDIV" caption="Divided Master Clock n is used as Serial Clock n source" value="0x0"/>
        <value name="SCKPIN" caption="SCKn input pin is used as Serial Clock n source" value="0x1"/>
      </value-group>
      <value-group name="I2S_CLKCTRL__SLOTSIZE">
        <value name="8" caption="8-bit Slot for Clock Unit n" value="0x0"/>
        <value name="16" caption="16-bit Slot for Clock Unit n" value="0x1"/>
        <value name="24" caption="24-bit Slot for Clock Unit n" value="0x2"/>
        <value name="32" caption="32-bit Slot for Clock Unit n" value="0x3"/>
      </value-group>
      <value-group name="I2S_SERCTRL__BITREV">
        <value name="MSBIT" caption="Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)" value="0x0"/>
        <value name="LSBIT" caption="Transfer Data Least Significant Bit (LSB) first" value="0x1"/>
      </value-group>
      <value-group name="I2S_SERCTRL__CLKSEL">
        <value name="CLK0" caption="Use Clock Unit 0" value="0x0"/>
        <value name="CLK1" caption="Use Clock Unit 1" value="0x1"/>
      </value-group>
      <value-group name="I2S_SERCTRL__DATASIZE">
        <value name="32" caption="32 bits" value="0x0"/>
        <value name="24" caption="24 bits" value="0x1"/>
        <value name="20" caption="20 bits" value="0x2"/>
        <value name="18" caption="18 bits" value="0x3"/>
        <value name="16" caption="16 bits" value="0x4"/>
        <value name="16C" caption="16 bits compact stereo" value="0x5"/>
        <value name="8" caption="8 bits" value="0x6"/>
        <value name="8C" caption="8 bits compact stereo" value="0x7"/>
      </value-group>
      <value-group name="I2S_SERCTRL__DMA">
        <value name="SINGLE" caption="Single DMA channel" value="0x0"/>
        <value name="MULTIPLE" caption="One DMA channel per data channel" value="0x1"/>
      </value-group>
      <value-group name="I2S_SERCTRL__EXTEND">
        <value name="ZERO" caption="Extend with zeroes" value="0x0"/>
        <value name="ONE" caption="Extend with ones" value="0x1"/>
        <value name="MSBIT" caption="Extend with Most Significant Bit" value="0x2"/>
        <value name="LSBIT" caption="Extend with Least Significant Bit" value="0x3"/>
      </value-group>
      <value-group name="I2S_SERCTRL__MONO">
        <value name="STEREO" caption="Normal mode" value="0x0"/>
        <value name="MONO" caption="Left channel data is duplicated to right channel" value="0x1"/>
      </value-group>
      <value-group name="I2S_SERCTRL__SERMODE">
        <value name="RX" caption="Receive" value="0x0"/>
        <value name="TX" caption="Transmit" value="0x1"/>
        <value name="PDM2" caption="Receive one PDM data on each serial clock edge" value="0x2"/>
      </value-group>
      <value-group name="I2S_SERCTRL__SLOTADJ">
        <value name="RIGHT" caption="Data is right adjusted in slot" value="0x0"/>
        <value name="LEFT" caption="Data is left adjusted in slot" value="0x1"/>
      </value-group>
      <value-group name="I2S_SERCTRL__TXDEFAULT">
        <value name="ZERO" caption="Output Default Value is 0" value="0x0"/>
        <value name="ONE" caption="Output Default Value is 1" value="0x1"/>
        <value name="HIZ" caption="Output Default Value is high impedance" value="0x3"/>
      </value-group>
      <value-group name="I2S_SERCTRL__TXSAME">
        <value name="ZERO" caption="Zero data transmitted in case of underrun" value="0x0"/>
        <value name="SAME" caption="Last data transmitted in case of underrun" value="0x1"/>
      </value-group>
      <value-group name="I2S_SERCTRL__WORDADJ">
        <value name="RIGHT" caption="Data is right adjusted in word" value="0x0"/>
        <value name="LEFT" caption="Data is left adjusted in word" value="0x1"/>
      </value-group>
    </module>
    <module name="MTB" id="U2002" version="1.0.0" caption="Cortex-M0+ Micro-Trace Buffer">
      <register-group name="MTB" caption="Cortex-M0+ Micro-Trace Buffer">
        <register name="POSITION" offset="0x0" rw="RW" size="4" access-size="4" caption="MTB Position">
          <bitfield name="WRAP" caption="Pointer Value Wraps" mask="0x4"/>
          <bitfield name="POINTER" caption="Trace Packet Location Pointer" mask="0xFFFFFFF8"/>
        </register>
        <register name="MASTER" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="MTB Master">
          <bitfield name="MASK" caption="Maximum Value of the Trace Buffer in SRAM" mask="0x1F"/>
          <bitfield name="TSTARTEN" caption="Trace Start Input Enable" mask="0x20"/>
          <bitfield name="TSTOPEN" caption="Trace Stop Input Enable" mask="0x40"/>
          <bitfield name="SFRWPRIV" caption="Special Function Register Write Privilege" mask="0x80"/>
          <bitfield name="RAMPRIV" caption="SRAM Privilege" mask="0x100"/>
          <bitfield name="HALTREQ" caption="Halt Request" mask="0x200"/>
          <bitfield name="EN" caption="Main Trace Enable" mask="0x80000000"/>
        </register>
        <register name="FLOW" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="MTB Flow">
          <bitfield name="AUTOSTOP" caption="Auto Stop Tracing" mask="0x1"/>
          <bitfield name="AUTOHALT" caption="Auto Halt Request" mask="0x2"/>
          <bitfield name="WATERMARK" caption="Watermark value" mask="0xFFFFFFF8"/>
        </register>
        <register name="BASE" offset="0xC" rw="R" size="4" access-size="4" caption="MTB Base">
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="MTB Integration Mode Control">
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="MTB Claim Set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="MTB Claim Clear">
        </register>
        <register name="LOCKACCESS" offset="0xFB0" rw="RW" size="4" access-size="4" caption="MTB Lock Access">
        </register>
        <register name="LOCKSTATUS" offset="0xFB4" rw="R" size="4" access-size="4" caption="MTB Lock Status">
        </register>
        <register name="AUTHSTATUS" offset="0xFB8" rw="R" size="4" access-size="4" caption="MTB Authentication Status">
        </register>
        <register name="DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" caption="MTB Device Architecture">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="MTB Device Configuration">
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="MTB Device Type">
        </register>
        <register name="PID4" offset="0xFD0" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="PID5" offset="0xFD4" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="PID6" offset="0xFD8" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="PID7" offset="0xFDC" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
